app/views/posts/_form.html.erb

SELECT "types".* FROM "types"
---
    <%= f.label :type_id %><br>
    <%= f.select :type_id, Type.all.collect {|p| [ p.name, p.id ] }, {include_blank: 'Please select post type'}, class: 'form-control' %>