app/views/posts/show.html.erb

<br>
<% @post.comments.order('created_at').each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  ORDER BY created_at  [["post_id", 2]]