app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.new(comment_params)
    @comment.user = current_user
    @comment.save
---
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Cool!"], ["post_id", 12], ["user_id", 2], ["created_at", "2017-04-14 14:54:11.728034"], ["updated_at", "2017-04-14 14:54:11.728034"]]

  def find_post
    @post = current_user.posts.find(params[:id]) if params[:id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 12]]