app/controllers/posts_controller.rb

  def index
    @posts = current_user.posts.order('created_at')
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  ORDER BY created_at  [["user_id", 1]]

  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("type_id", "title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["type_id", 2], ["title", "Dummy"], ["description", "Testing"], ["user_id", 1], ["created_at", "2017-04-14 14:36:44.013198"], ["updated_at", "2017-04-14 14:36:44.013198"]]