app/controllers/users_controller.rb

	def update
		current_user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Dummy"], ["last_name", "Name"], ["updated_at", "2017-04-14 14:55:01.227928"], ["id", 2]]