app/controllers/welcome_controller.rb

SELECT  "types".* FROM "types" WHERE (lower(name) = 'academic')  ORDER BY "types"."id" ASC LIMIT 1
SELECT  "posts".* FROM "posts" WHERE "posts"."type_id" = $1  ORDER BY created_at desc LIMIT 10 OFFSET 0  [["type_id", 1]]
SELECT COUNT(*) FROM "posts"
---
  def index
  	if params[:search]
  		type = Type.where('lower(name) = ?', params[:search].downcase).first
	  	@posts = type.posts.order('created_at desc').page params[:page]